polesskiy-dev/iot-risk-data-logger-nfc-samd21/firmware/src/packs/ATSAMD21E18A_DFP/component/i2s.h
#define I2S_SERCTRL_SERMODE_Pos               _UINT32_(0)                                          /* (I2S_SERCTRL) Serializer Mode Position */
#define I2S_SERCTRL_SERMODE_Msk               (_UINT32_(0x3) << I2S_SERCTRL_SERMODE_Pos)           /* (I2S_SERCTRL) Serializer Mode Mask */
#define I2S_SERCTRL_SERMODE(value)            (I2S_SERCTRL_SERMODE_Msk & (_UINT32_(value) << I2S_SERCTRL_SERMODE_Pos)) /* Assigment of value for SERMODE in the I2S_SERCTRL register */
#define   I2S_SERCTRL_SERMODE_RX_Val          _UINT32_(0x0)                                        /* (I2S_SERCTRL) Receive  */
#define   I2S_SERCTRL_SERMODE_TX_Val          _UINT32_(0x1)                                        /* (I2S_SERCTRL) Transmit  */
#define   I2S_SERCTRL_SERMODE_PDM2_Val        _UINT32_(0x2)                                        /* (I2S_SERCTRL) Receive one PDM data on each serial clock edge  */
#define I2S_SERCTRL_SERMODE_RX                (I2S_SERCTRL_SERMODE_RX_Val << I2S_SERCTRL_SERMODE_Pos) /* (I2S_SERCTRL) Receive Position  */
#define I2S_SERCTRL_SERMODE_TX                (I2S_SERCTRL_SERMODE_TX_Val << I2S_SERCTRL_SERMODE_Pos) /* (I2S_SERCTRL) Transmit Position  */
#define I2S_SERCTRL_SERMODE_PDM2              (I2S_SERCTRL_SERMODE_PDM2_Val << I2S_SERCTRL_SERMODE_Pos) /* (I2S_SERCTRL) Receive one PDM data on each serial clock edge Position  */
#define I2S_SERCTRL_TXDEFAULT_Pos             _UINT32_(2)                                          /* (I2S_SERCTRL) Line Default Line when Slot Disabled Position */
#define I2S_SERCTRL_TXDEFAULT_Msk             (_UINT32_(0x3) << I2S_SERCTRL_TXDEFAULT_Pos)         /* (I2S_SERCTRL) Line Default Line when Slot Disabled Mask */
#define I2S_SERCTRL_TXDEFAULT(value)          (I2S_SERCTRL_TXDEFAULT_Msk & (_UINT32_(value) << I2S_SERCTRL_TXDEFAULT_Pos)) /* Assigment of value for TXDEFAULT in the I2S_SERCTRL register */
#define   I2S_SERCTRL_TXDEFAULT_ZERO_Val      _UINT32_(0x0)                                        /* (I2S_SERCTRL) Output Default Value is 0  */
#define   I2S_SERCTRL_TXDEFAULT_ONE_Val       _UINT32_(0x1)                                        /* (I2S_SERCTRL) Output Default Value is 1  */
#define   I2S_SERCTRL_TXDEFAULT_HIZ_Val       _UINT32_(0x3)                                        /* (I2S_SERCTRL) Output Default Value is high impedance  */
#define I2S_SERCTRL_TXDEFAULT_ZERO            (I2S_SERCTRL_TXDEFAULT_ZERO_Val << I2S_SERCTRL_TXDEFAULT_Pos) /* (I2S_SERCTRL) Output Default Value is 0 Position  */
#define I2S_SERCTRL_TXDEFAULT_ONE             (I2S_SERCTRL_TXDEFAULT_ONE_Val << I2S_SERCTRL_TXDEFAULT_Pos) /* (I2S_SERCTRL) Output Default Value is 1 Position  */
#define I2S_SERCTRL_TXDEFAULT_HIZ             (I2S_SERCTRL_TXDEFAULT_HIZ_Val << I2S_SERCTRL_TXDEFAULT_Pos) /* (I2S_SERCTRL) Output Default Value is high impedance Position  */
#define I2S_SERCTRL_TXSAME_Pos                _UINT32_(4)                                          /* (I2S_SERCTRL) Transmit Data when Underrun Position */
#define I2S_SERCTRL_TXSAME_Msk                (_UINT32_(0x1) << I2S_SERCTRL_TXSAME_Pos)            /* (I2S_SERCTRL) Transmit Data when Underrun Mask */
#define I2S_SERCTRL_TXSAME(value)             (I2S_SERCTRL_TXSAME_Msk & (_UINT32_(value) << I2S_SERCTRL_TXSAME_Pos)) /* Assigment of value for TXSAME in the I2S_SERCTRL register */
#define   I2S_SERCTRL_TXSAME_ZERO_Val         _UINT32_(0x0)                                        /* (I2S_SERCTRL) Zero data transmitted in case of underrun  */
#define   I2S_SERCTRL_TXSAME_SAME_Val         _UINT32_(0x1)                                        /* (I2S_SERCTRL) Last data transmitted in case of underrun  */
#define I2S_SERCTRL_TXSAME_ZERO               (I2S_SERCTRL_TXSAME_ZERO_Val << I2S_SERCTRL_TXSAME_Pos) /* (I2S_SERCTRL) Zero data transmitted in case of underrun Position  */
#define I2S_SERCTRL_TXSAME_SAME               (I2S_SERCTRL_TXSAME_SAME_Val << I2S_SERCTRL_TXSAME_Pos) /* (I2S_SERCTRL) Last data transmitted in case of underrun Position  */
#define I2S_SERCTRL_CLKSEL_Pos                _UINT32_(5)                                          /* (I2S_SERCTRL) Clock Unit Selection Position */
#define I2S_SERCTRL_CLKSEL_Msk                (_UINT32_(0x1) << I2S_SERCTRL_CLKSEL_Pos)            /* (I2S_SERCTRL) Clock Unit Selection Mask */
#define I2S_SERCTRL_CLKSEL(value)             (I2S_SERCTRL_CLKSEL_Msk & (_UINT32_(value) << I2S_SERCTRL_CLKSEL_Pos)) /* Assigment of value for CLKSEL in the I2S_SERCTRL register */
#define   I2S_SERCTRL_CLKSEL_CLK0_Val         _UINT32_(0x0)                                        /* (I2S_SERCTRL) Use Clock Unit 0  */
#define   I2S_SERCTRL_CLKSEL_CLK1_Val         _UINT32_(0x1)                                        /* (I2S_SERCTRL) Use Clock Unit 1  */
#define I2S_SERCTRL_CLKSEL_CLK0               (I2S_SERCTRL_CLKSEL_CLK0_Val << I2S_SERCTRL_CLKSEL_Pos) /* (I2S_SERCTRL) Use Clock Unit 0 Position  */
#define I2S_SERCTRL_CLKSEL_CLK1               (I2S_SERCTRL_CLKSEL_CLK1_Val << I2S_SERCTRL_CLKSEL_Pos) /* (I2S_SERCTRL) Use Clock Unit 1 Position  */
#define I2S_SERCTRL_SLOTADJ_Pos               _UINT32_(7)                                          /* (I2S_SERCTRL) Data Slot Formatting Adjust Position */
#define I2S_SERCTRL_SLOTADJ_Msk               (_UINT32_(0x1) << I2S_SERCTRL_SLOTADJ_Pos)           /* (I2S_SERCTRL) Data Slot Formatting Adjust Mask */
#define I2S_SERCTRL_SLOTADJ(value)            (I2S_SERCTRL_SLOTADJ_Msk & (_UINT32_(value) << I2S_SERCTRL_SLOTADJ_Pos)) /* Assigment of value for SLOTADJ in the I2S_SERCTRL register */
#define   I2S_SERCTRL_SLOTADJ_RIGHT_Val       _UINT32_(0x0)                                        /* (I2S_SERCTRL) Data is right adjusted in slot  */
#define   I2S_SERCTRL_SLOTADJ_LEFT_Val        _UINT32_(0x1)                                        /* (I2S_SERCTRL) Data is left adjusted in slot  */
#define I2S_SERCTRL_SLOTADJ_RIGHT             (I2S_SERCTRL_SLOTADJ_RIGHT_Val << I2S_SERCTRL_SLOTADJ_Pos) /* (I2S_SERCTRL) Data is right adjusted in slot Position  */
#define I2S_SERCTRL_SLOTADJ_LEFT              (I2S_SERCTRL_SLOTADJ_LEFT_Val << I2S_SERCTRL_SLOTADJ_Pos) /* (I2S_SERCTRL) Data is left adjusted in slot Position  */
#define I2S_SERCTRL_DATASIZE_Pos              _UINT32_(8)                                          /* (I2S_SERCTRL) Data Word Size Position */
#define I2S_SERCTRL_DATASIZE_Msk              (_UINT32_(0x7) << I2S_SERCTRL_DATASIZE_Pos)          /* (I2S_SERCTRL) Data Word Size Mask */
#define I2S_SERCTRL_DATASIZE(value)           (I2S_SERCTRL_DATASIZE_Msk & (_UINT32_(value) << I2S_SERCTRL_DATASIZE_Pos)) /* Assigment of value for DATASIZE in the I2S_SERCTRL register */
#define   I2S_SERCTRL_DATASIZE_32_Val         _UINT32_(0x0)                                        /* (I2S_SERCTRL) 32 bits  */
#define   I2S_SERCTRL_DATASIZE_24_Val         _UINT32_(0x1)                                        /* (I2S_SERCTRL) 24 bits  */
#define   I2S_SERCTRL_DATASIZE_20_Val         _UINT32_(0x2)                                        /* (I2S_SERCTRL) 20 bits  */
#define   I2S_SERCTRL_DATASIZE_18_Val         _UINT32_(0x3)                                        /* (I2S_SERCTRL) 18 bits  */
#define   I2S_SERCTRL_DATASIZE_16_Val         _UINT32_(0x4)                                        /* (I2S_SERCTRL) 16 bits  */
#define   I2S_SERCTRL_DATASIZE_16C_Val        _UINT32_(0x5)                                        /* (I2S_SERCTRL) 16 bits compact stereo  */
#define   I2S_SERCTRL_DATASIZE_8_Val          _UINT32_(0x6)                                        /* (I2S_SERCTRL) 8 bits  */
#define   I2S_SERCTRL_DATASIZE_8C_Val         _UINT32_(0x7)                                        /* (I2S_SERCTRL) 8 bits compact stereo  */
#define I2S_SERCTRL_DATASIZE_32               (I2S_SERCTRL_DATASIZE_32_Val << I2S_SERCTRL_DATASIZE_Pos) /* (I2S_SERCTRL) 32 bits Position  */
#define I2S_SERCTRL_DATASIZE_24               (I2S_SERCTRL_DATASIZE_24_Val << I2S_SERCTRL_DATASIZE_Pos) /* (I2S_SERCTRL) 24 bits Position  */
#define I2S_SERCTRL_DATASIZE_20               (I2S_SERCTRL_DATASIZE_20_Val << I2S_SERCTRL_DATASIZE_Pos) /* (I2S_SERCTRL) 20 bits Position  */
#define I2S_SERCTRL_DATASIZE_18               (I2S_SERCTRL_DATASIZE_18_Val << I2S_SERCTRL_DATASIZE_Pos) /* (I2S_SERCTRL) 18 bits Position  */
#define I2S_SERCTRL_DATASIZE_16               (I2S_SERCTRL_DATASIZE_16_Val << I2S_SERCTRL_DATASIZE_Pos) /* (I2S_SERCTRL) 16 bits Position  */
#define I2S_SERCTRL_DATASIZE_16C              (I2S_SERCTRL_DATASIZE_16C_Val << I2S_SERCTRL_DATASIZE_Pos) /* (I2S_SERCTRL) 16 bits compact stereo Position  */
#define I2S_SERCTRL_DATASIZE_8                (I2S_SERCTRL_DATASIZE_8_Val << I2S_SERCTRL_DATASIZE_Pos) /* (I2S_SERCTRL) 8 bits Position  */
#define I2S_SERCTRL_DATASIZE_8C               (I2S_SERCTRL_DATASIZE_8C_Val << I2S_SERCTRL_DATASIZE_Pos) /* (I2S_SERCTRL) 8 bits compact stereo Position  */
#define I2S_SERCTRL_WORDADJ_Pos               _UINT32_(12)                                         /* (I2S_SERCTRL) Data Word Formatting Adjust Position */
#define I2S_SERCTRL_WORDADJ_Msk               (_UINT32_(0x1) << I2S_SERCTRL_WORDADJ_Pos)           /* (I2S_SERCTRL) Data Word Formatting Adjust Mask */
#define I2S_SERCTRL_WORDADJ(value)            (I2S_SERCTRL_WORDADJ_Msk & (_UINT32_(value) << I2S_SERCTRL_WORDADJ_Pos)) /* Assigment of value for WORDADJ in the I2S_SERCTRL register */
#define   I2S_SERCTRL_WORDADJ_RIGHT_Val       _UINT32_(0x0)                                        /* (I2S_SERCTRL) Data is right adjusted in word  */
#define   I2S_SERCTRL_WORDADJ_LEFT_Val        _UINT32_(0x1)                                        /* (I2S_SERCTRL) Data is left adjusted in word  */
#define I2S_SERCTRL_WORDADJ_RIGHT             (I2S_SERCTRL_WORDADJ_RIGHT_Val << I2S_SERCTRL_WORDADJ_Pos) /* (I2S_SERCTRL) Data is right adjusted in word Position  */
#define I2S_SERCTRL_WORDADJ_LEFT              (I2S_SERCTRL_WORDADJ_LEFT_Val << I2S_SERCTRL_WORDADJ_Pos) /* (I2S_SERCTRL) Data is left adjusted in word Position  */
#define I2S_SERCTRL_EXTEND_Pos                _UINT32_(13)                                         /* (I2S_SERCTRL) Data Formatting Bit Extension Position */
#define I2S_SERCTRL_EXTEND_Msk                (_UINT32_(0x3) << I2S_SERCTRL_EXTEND_Pos)            /* (I2S_SERCTRL) Data Formatting Bit Extension Mask */
#define I2S_SERCTRL_EXTEND(value)             (I2S_SERCTRL_EXTEND_Msk & (_UINT32_(value) << I2S_SERCTRL_EXTEND_Pos)) /* Assigment of value for EXTEND in the I2S_SERCTRL register */
#define   I2S_SERCTRL_EXTEND_ZERO_Val         _UINT32_(0x0)                                        /* (I2S_SERCTRL) Extend with zeroes  */
#define   I2S_SERCTRL_EXTEND_ONE_Val          _UINT32_(0x1)                                        /* (I2S_SERCTRL) Extend with ones  */
#define   I2S_SERCTRL_EXTEND_MSBIT_Val        _UINT32_(0x2)                                        /* (I2S_SERCTRL) Extend with Most Significant Bit  */
#define   I2S_SERCTRL_EXTEND_LSBIT_Val        _UINT32_(0x3)                                        /* (I2S_SERCTRL) Extend with Least Significant Bit  */
#define I2S_SERCTRL_EXTEND_ZERO               (I2S_SERCTRL_EXTEND_ZERO_Val << I2S_SERCTRL_EXTEND_Pos) /* (I2S_SERCTRL) Extend with zeroes Position  */
#define I2S_SERCTRL_EXTEND_ONE                (I2S_SERCTRL_EXTEND_ONE_Val << I2S_SERCTRL_EXTEND_Pos) /* (I2S_SERCTRL) Extend with ones Position  */
#define I2S_SERCTRL_EXTEND_MSBIT              (I2S_SERCTRL_EXTEND_MSBIT_Val << I2S_SERCTRL_EXTEND_Pos) /* (I2S_SERCTRL) Extend with Most Significant Bit Position  */
#define I2S_SERCTRL_EXTEND_LSBIT              (I2S_SERCTRL_EXTEND_LSBIT_Val << I2S_SERCTRL_EXTEND_Pos) /* (I2S_SERCTRL) Extend with Least Significant Bit Position  */
#define I2S_SERCTRL_BITREV_Pos                _UINT32_(15)                                         /* (I2S_SERCTRL) Data Formatting Bit Reverse Position */
#define I2S_SERCTRL_BITREV_Msk                (_UINT32_(0x1) << I2S_SERCTRL_BITREV_Pos)            /* (I2S_SERCTRL) Data Formatting Bit Reverse Mask */
#define I2S_SERCTRL_BITREV(value)             (I2S_SERCTRL_BITREV_Msk & (_UINT32_(value) << I2S_SERCTRL_BITREV_Pos)) /* Assigment of value for BITREV in the I2S_SERCTRL register */
#define   I2S_SERCTRL_BITREV_MSBIT_Val        _UINT32_(0x0)                                        /* (I2S_SERCTRL) Transfer Data Most Significant Bit (MSB) first (default for I2S protocol)  */
#define   I2S_SERCTRL_BITREV_LSBIT_Val        _UINT32_(0x1)                                        /* (I2S_SERCTRL) Transfer Data Least Significant Bit (LSB) first  */
#define I2S_SERCTRL_BITREV_MSBIT              (I2S_SERCTRL_BITREV_MSBIT_Val << I2S_SERCTRL_BITREV_Pos) /* (I2S_SERCTRL) Transfer Data Most Significant Bit (MSB) first (default for I2S protocol) Position  */
#define I2S_SERCTRL_BITREV_LSBIT              (I2S_SERCTRL_BITREV_LSBIT_Val << I2S_SERCTRL_BITREV_Pos) /* (I2S_SERCTRL) Transfer Data Least Significant Bit (LSB) first Position  */
#define I2S_SERCTRL_SLOTDIS0_Pos              _UINT32_(16)                                         /* (I2S_SERCTRL) Slot 0 Disabled for this Serializer Position */
#define I2S_SERCTRL_SLOTDIS0_Msk              (_UINT32_(0x1) << I2S_SERCTRL_SLOTDIS0_Pos)          /* (I2S_SERCTRL) Slot 0 Disabled for this Serializer Mask */
#define I2S_SERCTRL_SLOTDIS0(value)           (I2S_SERCTRL_SLOTDIS0_Msk & (_UINT32_(value) << I2S_SERCTRL_SLOTDIS0_Pos)) /* Assigment of value for SLOTDIS0 in the I2S_SERCTRL register */
#define I2S_SERCTRL_SLOTDIS1_Pos              _UINT32_(17)                                         /* (I2S_SERCTRL) Slot 1 Disabled for this Serializer Position */
#define I2S_SERCTRL_SLOTDIS1_Msk              (_UINT32_(0x1) << I2S_SERCTRL_SLOTDIS1_Pos)          /* (I2S_SERCTRL) Slot 1 Disabled for this Serializer Mask */
#define I2S_SERCTRL_SLOTDIS1(value)           (I2S_SERCTRL_SLOTDIS1_Msk & (_UINT32_(value) << I2S_SERCTRL_SLOTDIS1_Pos)) /* Assigment of value for SLOTDIS1 in the I2S_SERCTRL register */
#define I2S_SERCTRL_SLOTDIS2_Pos              _UINT32_(18)                                         /* (I2S_SERCTRL) Slot 2 Disabled for this Serializer Position */
#define I2S_SERCTRL_SLOTDIS2_Msk              (_UINT32_(0x1) << I2S_SERCTRL_SLOTDIS2_Pos)          /* (I2S_SERCTRL) Slot 2 Disabled for this Serializer Mask */
#define I2S_SERCTRL_SLOTDIS2(value)           (I2S_SERCTRL_SLOTDIS2_Msk & (_UINT32_(value) << I2S_SERCTRL_SLOTDIS2_Pos)) /* Assigment of value for SLOTDIS2 in the I2S_SERCTRL register */
#define I2S_SERCTRL_SLOTDIS3_Pos              _UINT32_(19)                                         /* (I2S_SERCTRL) Slot 3 Disabled for this Serializer Position */
#define I2S_SERCTRL_SLOTDIS3_Msk              (_UINT32_(0x1) << I2S_SERCTRL_SLOTDIS3_Pos)          /* (I2S_SERCTRL) Slot 3 Disabled for this Serializer Mask */
#define I2S_SERCTRL_SLOTDIS3(value)           (I2S_SERCTRL_SLOTDIS3_Msk & (_UINT32_(value) << I2S_SERCTRL_SLOTDIS3_Pos)) /* Assigment of value for SLOTDIS3 in the I2S_SERCTRL register */
#define I2S_SERCTRL_SLOTDIS4_Pos              _UINT32_(20)                                         /* (I2S_SERCTRL) Slot 4 Disabled for this Serializer Position */
#define I2S_SERCTRL_SLOTDIS4_Msk              (_UINT32_(0x1) << I2S_SERCTRL_SLOTDIS4_Pos)          /* (I2S_SERCTRL) Slot 4 Disabled for this Serializer Mask */
#define I2S_SERCTRL_SLOTDIS4(value)           (I2S_SERCTRL_SLOTDIS4_Msk & (_UINT32_(value) << I2S_SERCTRL_SLOTDIS4_Pos)) /* Assigment of value for SLOTDIS4 in the I2S_SERCTRL register */
#define I2S_SERCTRL_SLOTDIS5_Pos              _UINT32_(21)                                         /* (I2S_SERCTRL) Slot 5 Disabled for this Serializer Position */
#define I2S_SERCTRL_SLOTDIS5_Msk              (_UINT32_(0x1) << I2S_SERCTRL_SLOTDIS5_Pos)          /* (I2S_SERCTRL) Slot 5 Disabled for this Serializer Mask */
#define I2S_SERCTRL_SLOTDIS5(value)           (I2S_SERCTRL_SLOTDIS5_Msk & (_UINT32_(value) << I2S_SERCTRL_SLOTDIS5_Pos)) /* Assigment of value for SLOTDIS5 in the I2S_SERCTRL register */
#define I2S_SERCTRL_SLOTDIS6_Pos              _UINT32_(22)                                         /* (I2S_SERCTRL) Slot 6 Disabled for this Serializer Position */
#define I2S_SERCTRL_SLOTDIS6_Msk              (_UINT32_(0x1) << I2S_SERCTRL_SLOTDIS6_Pos)          /* (I2S_SERCTRL) Slot 6 Disabled for this Serializer Mask */
#define I2S_SERCTRL_SLOTDIS6(value)           (I2S_SERCTRL_SLOTDIS6_Msk & (_UINT32_(value) << I2S_SERCTRL_SLOTDIS6_Pos)) /* Assigment of value for SLOTDIS6 in the I2S_SERCTRL register */
#define I2S_SERCTRL_SLOTDIS7_Pos              _UINT32_(23)                                         /* (I2S_SERCTRL) Slot 7 Disabled for this Serializer Position */
#define I2S_SERCTRL_SLOTDIS7_Msk              (_UINT32_(0x1) << I2S_SERCTRL_SLOTDIS7_Pos)          /* (I2S_SERCTRL) Slot 7 Disabled for this Serializer Mask */
#define I2S_SERCTRL_SLOTDIS7(value)           (I2S_SERCTRL_SLOTDIS7_Msk & (_UINT32_(value) << I2S_SERCTRL_SLOTDIS7_Pos)) /* Assigment of value for SLOTDIS7 in the I2S_SERCTRL register */
#define I2S_SERCTRL_MONO_Pos                  _UINT32_(24)                                         /* (I2S_SERCTRL) Mono Mode Position */
#define I2S_SERCTRL_MONO_Msk                  (_UINT32_(0x1) << I2S_SERCTRL_MONO_Pos)              /* (I2S_SERCTRL) Mono Mode Mask */
#define I2S_SERCTRL_MONO(value)               (I2S_SERCTRL_MONO_Msk & (_UINT32_(value) << I2S_SERCTRL_MONO_Pos)) /* Assigment of value for MONO in the I2S_SERCTRL register */
#define   I2S_SERCTRL_MONO_STEREO_Val         _UINT32_(0x0)                                        /* (I2S_SERCTRL) Normal mode  */
#define   I2S_SERCTRL_MONO_MONO_Val           _UINT32_(0x1)                                        /* (I2S_SERCTRL) Left channel data is duplicated to right channel  */
#define I2S_SERCTRL_MONO_STEREO               (I2S_SERCTRL_MONO_STEREO_Val << I2S_SERCTRL_MONO_Pos) /* (I2S_SERCTRL) Normal mode Position  */
#define I2S_SERCTRL_MONO_MONO                 (I2S_SERCTRL_MONO_MONO_Val << I2S_SERCTRL_MONO_Pos)  /* (I2S_SERCTRL) Left channel data is duplicated to right channel Position  */
#define I2S_SERCTRL_DMA_Pos                   _UINT32_(25)                                         /* (I2S_SERCTRL) Single or Multiple DMA Channels Position */
#define I2S_SERCTRL_DMA_Msk                   (_UINT32_(0x1) << I2S_SERCTRL_DMA_Pos)               /* (I2S_SERCTRL) Single or Multiple DMA Channels Mask */
#define I2S_SERCTRL_DMA(value)                (I2S_SERCTRL_DMA_Msk & (_UINT32_(value) << I2S_SERCTRL_DMA_Pos)) /* Assigment of value for DMA in the I2S_SERCTRL register */
#define   I2S_SERCTRL_DMA_SINGLE_Val          _UINT32_(0x0)                                        /* (I2S_SERCTRL) Single DMA channel  */
#define   I2S_SERCTRL_DMA_MULTIPLE_Val        _UINT32_(0x1)                                        /* (I2S_SERCTRL) One DMA channel per data channel  */
#define I2S_SERCTRL_DMA_SINGLE                (I2S_SERCTRL_DMA_SINGLE_Val << I2S_SERCTRL_DMA_Pos)  /* (I2S_SERCTRL) Single DMA channel Position  */
#define I2S_SERCTRL_DMA_MULTIPLE              (I2S_SERCTRL_DMA_MULTIPLE_Val << I2S_SERCTRL_DMA_Pos) /* (I2S_SERCTRL) One DMA channel per data channel Position  */
#define I2S_SERCTRL_RXLOOP_Pos                _UINT32_(26)                                         /* (I2S_SERCTRL) Loop-back Test Mode Position */
#define I2S_SERCTRL_RXLOOP_Msk                (_UINT32_(0x1) << I2S_SERCTRL_RXLOOP_Pos)            /* (I2S_SERCTRL) Loop-back Test Mode Mask */
#define I2S_SERCTRL_RXLOOP(value)             (I2S_SERCTRL_RXLOOP_Msk & (_UINT32_(value) << I2S_SERCTRL_RXLOOP_Pos)) /* Assigment of value for RXLOOP in the I2S_SERCTRL register */
#define I2S_SERCTRL_Msk                       _UINT32_(0x07FFF7BF)                                 /* (I2S_SERCTRL) Register Mask  */

#define I2S_SERCTRL_SLOTDIS_Pos               _UINT32_(16)                                         /* (I2S_SERCTRL Position) Slot x Disabled for this Serializer */
#define I2S_SERCTRL_SLOTDIS_Msk               (_UINT32_(0xFF) << I2S_SERCTRL_SLOTDIS_Pos)          /* (I2S_SERCTRL Mask) SLOTDIS */
#define I2S_SERCTRL_SLOTDIS(value)            (I2S_SERCTRL_SLOTDIS_Msk & (_UINT32_(value) << I2S_SERCTRL_SLOTDIS_Pos)) 

/* -------- I2S_DATA : (I2S Offset: 0x30) (R/W 32) Data n -------- */
#define I2S_DATA_RESETVALUE                   _UINT32_(0x00)                                       /*  (I2S_DATA) Data n  Reset Value */

#define I2S_DATA_DATA_Pos                     _UINT32_(0)                                          /* (I2S_DATA) Sample Data Position */
#define I2S_DATA_DATA_Msk                     (_UINT32_(0xFFFFFFFF) << I2S_DATA_DATA_Pos)          /* (I2S_DATA) Sample Data Mask */
#define I2S_DATA_DATA(value)                  (I2S_DATA_DATA_Msk & (_UINT32_(value) << I2S_DATA_DATA_Pos)) /* Assigment of value for DATA in the I2S_DATA register */
#define I2S_DATA_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (I2S_DATA) Register Mask  */


